package Basic

/*
                   _ooOoo_
                  o8888888o
                  88" . "88
                  (| -_- |)
                  O\  =  /O
               ____/`---'\____
             .'  \\|     |//  `.
            /  \\|||  :  |||//  \
           /  _||||| -:- |||||-  \
           |   | \\\  -  /// |   |
           | \_|  ''\---/''  |   |
           \  .-\__  `-`  ___/-. /
         ___`. .'  /--.--\  `. . __
      ."" '<  `.___\_<|>_/___.'  >'"".
     | | :  `- \`.;`\ _ /`;.`/ - ` : | |
     \  \ `-.   \_ __\ /__ _/   .-` /  /
======`-.____`-.___\_____/___.-`____.-'======
                   `=---='
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
         佛祖保佑       永无BUG
         Create by Caesar,2016/1/6
*/
object ValAndVar {

  def main(args: Array[String]) {

    /**
     * 变量：声明用var
     * 常量：声明用val
     * 数据类型：在变量(常量)后的冒号后面来标注,也可以省略，编译器能自动推断，如果只声明，不初始化会报错
     * 声明多个变量：可以在一行声明多个变量，之间用;隔开
     */

    //TODO:常量
    val foo:String = "hello"
    // foo = "world"  foo不能被修改，因为是常量而不是变量
    println(foo)

    //TODO:变量
    var fooVar = "world"
    fooVar = "myWorld"
    println(fooVar)

    //TODO:多变量
    var tp = 1;var tp2 = 2
    // ts,ts2 都为3
    var ts ,ts2 = 3
    println(ts,ts2)





  }

}
