package ClassExtend

/*
                   _ooOoo_
                  o8888888o
                  88" . "88
                  (| -_- |)
                  O\  =  /O
               ____/`---'\____
             .'  \\|     |//  `.
            /  \\|||  :  |||//  \
           /  _||||| -:- |||||-  \
           |   | \\\  -  /// |   |
           | \_|  ''\---/''  |   |
           \  .-\__  `-`  ___/-. /
         ___`. .'  /--.--\  `. . __
      ."" '<  `.___\_<|>_/___.'  >'"".
     | | :  `- \`.;`\ _ /`;.`/ - ` : | |
     \  \ `-.   \_ __\ /__ _/   .-` /  /
======`-.____`-.___\_____/___.-`____.-'======
                   `=---='
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
         佛祖保佑       永无BUG
         Create by Caesar,2016/1/14
*/
abstract class AbstractClass {

  /**
   *
   * 抽象类：
   * 抽象字段：
   *
   *
   */
  //没有初始化，就是抽象字段，带有抽象的getter方法
  val a:String
  //抽象变量，带有getter和setter
  var b:String

}

//提前定义，构造器执行前，进行初始化字段
class SubClass extends {

  val a=""
  var b=""
} with AbstractClass{

}

